# my_yolo_pose.yaml

nc: 1        # number of classes
nkpt: 17     # number of keypoints
depth_multiple: 1.0
width_multiple: 1.0

backbone:
  - [-1, 1, Conv, [32, 3, 1]]
  - [-1, 1, Conv, [64, 3, 2]]
  - [-1, 3, C3, [64]]
  - [-1, 1, Conv, [128, 3, 2]]
  - [-1, 6, C3, [128]]

head:
  - [-1, 1, SPPF, [256, 5]]
  - [-1, 3, C3, [256, False]]
  - [-1, 1, Pose, [nc, nkpt]]
